**CREATE DATABASE имя_базы_данных;**
Выбор базы данных



**USE имя_базы_данных;**
Удаление базы данных



**DROP DATABASE имя_базы_данных;**
Таблицы
Создание таблицы



**CREATE TABLE имя_таблицы (
    id INT AUTO_INCREMENT PRIMARY KEY,
    имя VARCHAR(255) NOT NULL,
    возраст INT
);**
Просмотр структуры таблицы



**DESCRIBE имя_таблицы;**
Удаление таблицы



**DROP TABLE имя_таблицы;**
Изменение таблицы (добавление столбца)



**ALTER TABLE имя_таблицы ADD COLUMN новый_столбец VARCHAR(255);**
Удаление столбца



**ALTER TABLE имя_таблицы DROP COLUMN столбец;**
Данные
Вставка данных



**INSERT INTO имя_таблицы (имя, возраст) VALUES ('Иван', 30);**
Выбор данных



**SELECT * FROM имя_таблицы;**
Обновление данных



**UPDATE имя_таблицы SET возраст = 31 WHERE имя = 'Иван';**
Удаление данных



**DELETE FROM имя_таблицы WHERE имя = 'Иван';**
Запросы
Фильтрация данных



**SELECT * FROM имя_таблицы WHERE возраст > 25;**
Сортировка данных



**SELECT * FROM имя_таблицы ORDER BY возраст DESC;**
Группировка данных



**SELECT возраст, COUNT(*) FROM имя_таблицы GROUP BY возраст;**
Индексы
Создание индекса



**CREATE INDEX имя_индекса ON имя_таблицы (столбец);**
Удаление индекса



**DROP INDEX имя_индекса ON имя_таблицы;# -**
